Tutorials-3.0.1/movingMesh/movingCone/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
	solver          PBiCG;
	tolerance       1e-08;
	relTol          1e-3;
	preconditioner  DILU;
    }

    "(U|h).*"
    {
	solver          PBiCG;
	preconditioner  DILU;
	tolerance       1e-08;
	relTol	0;
    }

    "rho.*"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
    
    cellMotionUx
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors      2;
    nNonOrthogonalCorrectors 1;
    checkMeshCourantNo true;

    nonOrthogonalityThreshold	60;
    skewnessThreshold		0.6;
}


// ************************************************************************* //
